{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f562093b-19c5-470a-8b42-a15128524ce7",
   "metadata": {},
   "outputs": [],
   "source": [
    "# pip install langchain langchain-google-genai langchain-neo4j\n",
    "# pip install openai"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a78be0fb-4186-456a-8f1e-5e79fd798865",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from uuid import uuid4\n",
    "\n",
    "from langchain_google_genai import ChatGoogleGenerativeAI\n",
    "from langchain.agents import AgentExecutor, create_react_agent\n",
    "from langchain.tools import Tool\n",
    "from langchain import hub\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.runnables.history import RunnableWithMessageHistory\n",
    "from langchain.schema import StrOutputParser\n",
    "from langchain_neo4j import Neo4jChatMessageHistory, Neo4jGraph\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "d4a6e28b-78fc-4527-ad24-c87208206064",
   "metadata": {},
   "outputs": [],
   "source": [
    "NEO4J_URI = \"<NEO4j_URI>\"\n",
    "NEO4J_USER = \"neo4j\"\n",
    "NEO4J_PASSWORD = \"<API KEY>\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "fdf5ae43-27e6-4584-839e-c3431a7cfbcc",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Session ID: e02c7de2-ef1e-4c5c-9a7a-dc573cba6acd\n"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\krish\\anaconda3\\Lib\\site-packages\\langsmith\\client.py:272: LangSmithMissingAPIKeyWarning: API key must be provided when using hosted LangSmith API\n",
      "  warnings.warn(\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      ">  plans pricing and all kinds of fees\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Here is the Cypher query that retrieves plans, their pricing, and all kinds of fees:\n",
      "\n",
      "```cypher\n",
      "MATCH (p:Plan)\n",
      "OPTIONAL MATCH (p)-[:HAS_PRICING]->(pricing:Pricing)\n",
      "OPTIONAL MATCH (p)-[:HAS_FEE]->(fee:Fee)\n",
      "OPTIONAL MATCH (p)-[:HAS_ONE_TIME_FEE]->(oneTimeFee:Fee)\n",
      "OPTIONAL MATCH (p)-[:HAS_EARLY_TERMINATION_FEE]->(earlyTerminationFee:Fee)\n",
      "OPTIONAL MATCH (p)-[:HAS_FEDERAL_FEE]->(federalFee:Fee)\n",
      "OPTIONAL MATCH (p)-[:HAS_REGULATORY_FEE]->(regulatoryFee:Fee)\n",
      "OPTIONAL MATCH (p)-[:HAS_TAX]->(tax:Fee)\n",
      "RETURN p, pricing, fee, oneTimeFee, earlyTerminationFee, federalFee, regulatoryFee, tax\n",
      "```\n"
     ]
    },
    {
     "name": "stdin",
     "output_type": "stream",
     "text": [
      ">  quit\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Exiting...\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Initialize session\n",
    "session_id = str(uuid4())\n",
    "print(f\"Session ID: {session_id}\")\n",
    "\n",
    "# Load environment variables once\n",
    "google_api_key = \"<API KEY>\" #os.environ.get(\"GOOGLE_API_KEY\")\n",
    "neo4j_uri = NEO4J_URI #os.environ.get(\"NEO4J_URI\")\n",
    "neo4j_user = NEO4J_USER #os.environ.get(\"NEO4J_USERNAME\")\n",
    "neo4j_pass = NEO4J_PASSWORD #os.environ.get(\"NEO4J_PASSWORD\")\n",
    "\n",
    "# Initialize Google Gemini model\n",
    "llm = ChatGoogleGenerativeAI(\n",
    "    model=\"gemini-2.0-flash\",\n",
    "    google_api_key=google_api_key,\n",
    "    temperature=0.2\n",
    ")\n",
    "\n",
    "# Initialize Neo4j\n",
    "graph = Neo4jGraph(url=neo4j_uri, username=neo4j_user, password=neo4j_pass)\n",
    "\n",
    "# Define prompt\n",
    "# prompt = ChatPromptTemplate.from_messages([\n",
    "#     (\"system\", \"Your job is to convert user input into a cypher query.Strictly respond only with a cypher query.\"),\n",
    "#     (\"human\", \"Create cypher query using these contents: {input}\")\n",
    "# ])\n",
    "graph_schema_system_prompt = \"\"\"In order for you to write cypher queries the following is the graph schema you need. Strictly stick to naming conventions and ontologies in the schema\"\"\" + str(graph.schema.replace('{','{{').replace('}','}}'))\n",
    "prompt = ChatPromptTemplate.from_messages([    \n",
    "    (\"system\", graph_schema_system_prompt),\n",
    "    (\"system\", \"Your job is to convert user input into a cypher query. Strictly respond only with a cypher query. Do not include any text except the generated Cypher statement.\"),\n",
    "    (\"human\", \"Create cypher query using these contents: {input}\"),\n",
    "])\n",
    "\n",
    "# Chain LLM with prompt\n",
    "cypher_chat = prompt | llm | StrOutputParser()\n",
    "\n",
    "# # Define memory\n",
    "def get_memory(session_id):\n",
    "    return Neo4jChatMessageHistory(session_id=session_id, graph=graph)\n",
    "\n",
    "# Tool definition\n",
    "tools = [\n",
    "    Tool.from_function(\n",
    "        name=\"Cypher Support\",\n",
    "        description=\"All things related to cypher queries Cypher queries or create cypher queries.\",\n",
    "        func=lambda x: cypher_chat.invoke({\"input\": x}),\n",
    "    )\n",
    "]\n",
    "\n",
    "# Agent setup\n",
    "agent_prompt = hub.pull(\"hwchase17/react-chat\")\n",
    "# agent_prompt = hub.pull(\"hwchase17/react\")\n",
    "agent = create_react_agent(llm, tools, agent_prompt)\n",
    "agent_executor = AgentExecutor(agent=agent, tools=tools)\n",
    "\n",
    "cypher_agent = RunnableWithMessageHistory(\n",
    "    agent_executor,\n",
    "    get_memory,\n",
    "    input_messages_key=\"input\",\n",
    "    history_messages_key=\"chat_history\",\n",
    ")\n",
    "'''\n",
    "We are not leveraging the neo4j for conversation history preservation here. \n",
    "The code is hear as placeholders I can have only one free neo4j cloud instance active at a time.\n",
    "'''\n",
    "# Main interaction loop\n",
    "while True:\n",
    "    try:\n",
    "        user_input = input(\"> \").strip()\n",
    "        if user_input.lower() in (\"exit\", \"quit\"):\n",
    "            print(\"Exiting...\")\n",
    "            break\n",
    "        more_context_input = \"write and find the cypher query equivalent of this : \"+ user_input\n",
    "        response = cypher_agent.invoke({\"input\": str(more_context_input)},\n",
    "                                       {\"configurable\": {\"session_id\": session_id}})\n",
    "        print(response.get(\"output\", \"[No output]\"))\n",
    "\n",
    "    except KeyboardInterrupt:\n",
    "        print(\"\\nSession ended by user.\")\n",
    "        break\n",
    "    except Exception as e:\n",
    "        print(f\"Error: {e}\")\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "be6ec691-d49f-4098-8716-5a18278888fa",
   "metadata": {},
   "outputs": [],
   "source": [
    "### Pipeline is fine - need to use seperate graph for conversation history and seperate for plans and domain details etc"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "04592aa8-71f6-4291-9dd5-f4833b533512",
   "metadata": {},
   "outputs": [],
   "source": [
    "parsed_cq = response[\"output\"].split(\"cypher\\n\")[1].split(\"\\n\")[0] # Parsing needs t be optimised for a output structure"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "dbe40ec3-47c9-462e-852b-879236394f0b",
   "metadata": {},
   "outputs": [],
   "source": [
    "parsed_cq = '''MATCH (p:Plan)\n",
    "OPTIONAL MATCH (p)-[:HAS_PRICING]->(pricing:Pricing)\n",
    "OPTIONAL MATCH (p)-[:HAS_FEE]->(fee:Fee)\n",
    "OPTIONAL MATCH (p)-[:HAS_ONE_TIME_FEE]->(oneTimeFee:Fee)\n",
    "OPTIONAL MATCH (p)-[:HAS_EARLY_TERMINATION_FEE]->(earlyTerminationFee:Fee)\n",
    "OPTIONAL MATCH (p)-[:HAS_FEDERAL_FEE]->(federalFee:Fee)\n",
    "OPTIONAL MATCH (p)-[:HAS_REGULATORY_FEE]->(regulatoryFee:Fee)\n",
    "OPTIONAL MATCH (p)-[:HAS_TAX]->(tax:Fee)\n",
    "RETURN p, pricing, fee, oneTimeFee, earlyTerminationFee, federalFee, regulatoryFee, tax'''"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "944a30e7-74ce-4e00-8c77-9ba60c33f984",
   "metadata": {},
   "outputs": [],
   "source": [
    "def execute_cypher_query(graph: Neo4jGraph, cypher_query: str):\n",
    "    try:\n",
    "        result = graph.query(cypher_query)\n",
    "        return result\n",
    "    except Exception as e:\n",
    "        return f\"Error executing Cypher query: {e}\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "567f7b69-1305-47dc-adbb-4a43d5e1e9a5",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_result = execute_cypher_query(graph, parsed_cq)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "7b030509-897c-48eb-9986-72211d187aad",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'p': {'monthly_price': '$40.00',\n",
       "   'disclosure_title': 'Broadband Consumer Label',\n",
       "   'name': 'Broadband Unlimited Talk and Text with 20GB of Data',\n",
       "   'data_included': '20 GB',\n",
       "   'additional_data_charges': 'Check terms and conditions'},\n",
       "  'pricing': None,\n",
       "  'fee': None,\n",
       "  'oneTimeFee': {'amount': 'Varies', 'name': 'One-Time Fees at Purchase'},\n",
       "  'earlyTerminationFee': {'amount': '$0.00', 'name': 'Early Termination Fee'},\n",
       "  'federalFee': {'amount': '$0.23',\n",
       "   'name': 'Federal Universal Service Fund (FUSF)'},\n",
       "  'regulatoryFee': {'amount': '$0.08', 'name': 'Regulatory Cost Recovery'},\n",
       "  'tax': {'amount': 'Varies by location', 'name': 'Government Taxes'}},\n",
       " {'p': {'monthly_price': '$40.00',\n",
       "   'disclosure_title': 'Broadband Consumer Label',\n",
       "   'name': 'Broadband Unlimited Talk and Text with 20GB of Data',\n",
       "   'data_included': '20 GB',\n",
       "   'additional_data_charges': 'Check terms and conditions'},\n",
       "  'pricing': None,\n",
       "  'fee': None,\n",
       "  'oneTimeFee': {'amount': '$0.00', 'name': 'Activation Fee'},\n",
       "  'earlyTerminationFee': {'amount': '$0.00', 'name': 'Early Termination Fee'},\n",
       "  'federalFee': {'amount': '$0.23',\n",
       "   'name': 'Federal Universal Service Fund (FUSF)'},\n",
       "  'regulatoryFee': {'amount': '$0.08', 'name': 'Regulatory Cost Recovery'},\n",
       "  'tax': {'amount': 'Varies by location', 'name': 'Government Taxes'}},\n",
       " {'p': {'monthly_price': '$40.00',\n",
       "   'disclosure_title': 'Broadband Consumer Label',\n",
       "   'name': 'Broadband Unlimited Talk and Text with 20GB of Data',\n",
       "   'data_included': '20 GB',\n",
       "   'additional_data_charges': 'Check terms and conditions'},\n",
       "  'pricing': None,\n",
       "  'fee': None,\n",
       "  'oneTimeFee': {'amount': '$0.00', 'name': 'Provider Monthly Fees'},\n",
       "  'earlyTerminationFee': {'amount': '$0.00', 'name': 'Early Termination Fee'},\n",
       "  'federalFee': {'amount': '$0.23',\n",
       "   'name': 'Federal Universal Service Fund (FUSF)'},\n",
       "  'regulatoryFee': {'amount': '$0.08', 'name': 'Regulatory Cost Recovery'},\n",
       "  'tax': {'amount': 'Varies by location', 'name': 'Government Taxes'}},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.00', 'name': 'Activation Fee', 'type': 'additional'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.00',\n",
       "   'name': 'Provider Monthly Fees',\n",
       "   'type': 'additional'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.26 - $0.37',\n",
       "   'name': 'Federal Universal Service Fund',\n",
       "   'type': 'additional'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.09 - $0.13',\n",
       "   'name': 'Regulatory Cost Recovery',\n",
       "   'type': 'additional'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.00', 'name': 'Activation Fee', 'type': 'one_time'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.26 - $0.37',\n",
       "   'name': 'Federal Universal Service Fund',\n",
       "   'type': 'one_time'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'monthly_price': '$225.00 per line',\n",
       "   'monthly_price_notes': 'Introductory Offer: $60.00 per line for the first 3 months with Auto Pay',\n",
       "   'disclosure_title': 'Mobile Broadband Consumer Disclosure',\n",
       "   'discounts_and_bundles_link': 'Available discounts and pricing options for broadband service bundled with other services like video, phones, and wireless services, and use of your own equipment like modem or routers.',\n",
       "   'name': 'Platinum Unlimited',\n",
       "   'data_included': 'Unlimited',\n",
       "   'additional_data_charges': 'Varies by location'},\n",
       "  'pricing': None,\n",
       "  'fee': {'amount': '$0.09 - $0.13',\n",
       "   'name': 'Regulatory Cost Recovery',\n",
       "   'type': 'one_time'},\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None},\n",
       " {'p': {'name': 'Unlimited Ultimate'},\n",
       "  'pricing': {'amount': 55.0, 'unit': '/line'},\n",
       "  'fee': None,\n",
       "  'oneTimeFee': None,\n",
       "  'earlyTerminationFee': None,\n",
       "  'federalFee': None,\n",
       "  'regulatoryFee': None,\n",
       "  'tax': None}]"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cbeff8fb-75e1-4df9-be9a-ab2fa44c4f4a",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python [conda env:base] *",
   "language": "python",
   "name": "conda-base-py"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.7"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
